app/views/profiles/_form.html.haml

SELECT `countries`.* FROM `countries`
---
    = f.label :country
    = f.collection_select :country_id, Country.all, :id, :description
  .actions