app/views/tasks/_form.html.haml

    = f.label :project
    = f.collection_select :project_id, Project.all, :id, :title
  .field
    = f.label 'Developer'
    = f.collection_select :user_id, User.all, :id, :email
  .field
---
SELECT `projects`.* FROM `projects`
SELECT `users`.* FROM `users`

    = f.label :tasktype
    = f.collection_select :tasktype_id, Tasktype.all, :id, :description
  .field
---
SELECT `tasktypes`.* FROM `tasktypes`