app/views/projects/_form.html.haml

SELECT `projectstatuses`.* FROM `projectstatuses`
SELECT `users`.* FROM `users`
---
    = f.label :projectstatus
    = f.collection_select :projectstatus_id, Projectstatus.all, :id, :description
  .field
    = f.label 'Team Leader'
    = f.collection_select :user_id, User.all, :id, :email
  .field