app/controllers/profiles_controller.rb

SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`id` = 1 LIMIT 1
---
  def show
    @profile = Profile.find(params[:id])

SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`id` = 1 LIMIT 1
---
  def edit
    @profile = Profile.find(params[:id])

SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`id` = 1 LIMIT 1
UPDATE `profiles` SET `name` = 'Lesther ', `bio` = 'esta es mi biografia', `country_id` = 1, `updated_at` = '2012-04-03 05:44:03' WHERE `profiles`.`id` = 1
---
  def update
    @profile = Profile.find(params[:id])

    respond_to do |format|
      if @profile.update_attributes(params[:profile])

SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`id` = 2 LIMIT 1
DELETE FROM `profiles` WHERE `profiles`.`id` = 2
---
  def destroy
    @profile = Profile.find(params[:id])
    @profile.destroy