app/controllers/projects_controller.rb

SELECT `projects`.* FROM `projects` INNER JOIN `tasks` ON `tasks`.`project_id` = `projects`.`id` WHERE (public = 1 or projects.user_id = 2 or tasks.user_id = 2)
SELECT `projects`.* FROM `projects` WHERE (public = 1 OR user_id = NULL)
---
  def index
    if (current_user != nil)
        @projects = Project.joins(:task).where("public = :public or projects.user_id = :current_user or tasks.user_id = :current_user",{:current_user => current_user,
                                               :public => true,
                                               })
    else
                @projects = Project.where(:public => true)

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1
---
  def show
    @project = Project.find(params[:id])

INSERT INTO `projects` (`begin_time`, `created_at`, `description`, `end_time`, `projectstatus_id`, `public`, `title`, `updated_at`, `user_id`) VALUES ('2012-04-03 02:48:00', '2012-04-03 02:49:05', 'asdasdasd', '2012-04-03 02:48:00', 1, 1, 'Prueba', '2012-04-03 02:49:05', 1)
---
  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1
UPDATE `projects` SET `user_id` = 2, `updated_at` = '2012-04-03 06:41:59' WHERE `projects`.`id` = 2
---
  def update
    @project = Project.find(params[:id])

    respond_to do |format|
      if @project.update_attributes(params[:project])