app/controllers/tasks_controller.rb

SELECT `tasks`.* FROM `tasks` INNER JOIN `projects` ON `projects`.`id` = `tasks`.`project_id` WHERE (public = 1 or projects.user_id = 1 or tasks.user_id = 1)
---
  def index
      if (current_user != nil)
         @tasks = Task.joins(:project).where("public = :public or projects.user_id = :current_user or tasks.user_id = :current_user",{:current_user => current_user,
                                                 :public => true,
                                                 })

SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 1 LIMIT 1
---
  def edit
    @task = Task.find(params[:id])

INSERT INTO `tasks` (`begin_time`, `created_at`, `description`, `difficulty`, `end_time`, `finished`, `project_id`, `tasktype_id`, `title`, `updated_at`, `user_id`) VALUES ('2012-04-03 02:01:00', '2012-04-03 02:02:58', 'asdsadasdasdas d as d as d as d as da sd a ', 3, '2012-04-03 02:01:00', 0, 1, 1, 'mte', '2012-04-03 02:02:58', 1)
---
  def create
    @task = Task.new(params[:task])

    respond_to do |format|
      if @task.save

SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 2 LIMIT 1
UPDATE `tasks` SET `user_id` = 1, `updated_at` = '2012-04-03 06:30:58' WHERE `tasks`.`id` = 2
---
  def update
    @task = Task.find(params[:id])

    respond_to do |format|
      if @task.update_attributes(params[:task])